<?php

return [
    'main'          =>    [
        'welcome_first_part'    => 'Учитесь на отлично, занимаясь',
        'welcome_second_part'   => 'с личным учителем',
        'description'           => 'Find Tutor - сервис, который позволяет найти репетитора или стать им за пару кликов.',
        'start'                 => 'Начать',
        'our_teachers'          => 'Наши учителя',
        'sign_up'               => 'Записаться',
        'advantages'            => [
            'title'         => 'Преимущества',
            'first'         => 'Домашние работы',
            'first_desc'    => 'Получайте задания от преподавателей',
            'second'        => 'Удобный поиск',
            'second_desc'   => 'Лёгкий и удобный поиск преподавателей',
            'third'         => 'Высокое качество обучения',
            'third_desc'    => 'Наши преподаватели - дипломированные специалисты',
            'fourth'        => 'Постоянная связь',
            'fourth_desc'   => 'Получайте сообщения от преподавателей',
        ],        
    ],
    'search'        =>  [
        'title'         => 'Поиск',
        'form_price'    => 'Мин. цена за урок',
        'form_subject'  => 'Введите предмет',
        'find'          => 'Поиск',
        'age'           => 'Возраст:',
        'subject'       => 'Предмет:',
        'price'         => 'Цена за урок:',
        'no_results'    => 'Нет результатов',
        'enter_search'  => 'Введите данные для поиска',
        'sign_up'       => 'Записаться',
    ],
    'admin'         =>   [
        'title'     => 'Список пользователей',
        'actions'   => [
            'confirm'   => 'Подтвердить',
            'block'     => 'Заблокировать',
            'un_conf'   => 'Снять подтверждение',
            'un_block'  => 'Снять блокировку',
        ],       
    ],
    'settings'      => [
        'title'         => 'Личный кабинет',
        'mark_as_read'  => 'Пометить как прочитанные',
        'delete'        => 'Удалить',
        'close'         => 'Закрыть',
        'contacts'      => 'Для связи используйте',
        'doc_desc'      => 'Документ должен доказывать, что вы имеете образование преподавателя. Ваш аккаунт будет подтвержден после проверки администратором этого документа.',
        'deletion'      => [
            'title'         => 'Удаление аккаунта',
            'description'   => 'Повторно активировать аккаунт будет нельзя. Ваш профиль будет удален немедленно, и вы не сможете его восстановить.',
            'confirm'       => 'Вы уверены, что хотите удалить аккаунт?',
        ],
        'message'       => [
            'title'         => 'Оставьте ему сообщение',
            'example'       => 'Не могу с вами связаться',
            'send'          => 'Отправить',
            'for_student'   => 'Сообщение от преподавателя',
        ],      
        'student_block' => [
            'title'     => 'Учителя, к которым вы записались',
            'cancel'    => 'Отменить запись',
        ],
        'teacher_block' => [
            'title'     =>  'Настройки учителя',
            'students'  =>  'Ученики, которые записались к вам',
            'cancel'    =>  'Удалить из списка учеников',
        ],
    ],
    'login' => [
        'title'         => 'Вход',
        'remember_me'   => 'Запомнить меня',  
        'forgot'        => 'Забыли пароль?',
        'enter'         => 'Вход',
    ],
    'register' => [
        'title'     => 'Регистрация',
        'role'      => [
            'title'     => 'Выберете кто вы?',
            'teacher'   => 'Я учитель',
            'student'   => 'Я ученик',
        ],  
        'create'    => 'Создать аккаунт',
    ],
    'verify' => [
        'title'         => 'Подтвердите вашу почту',
        'check'         => 'Проверьте вашу почту',
        'not_receive'   => 'Если вы не получили сообщение,',
        'send_new'      => 'Нажмите сюда, чтобы запросить новое сообщение',
    ],
];
